#+TODO: TODO(t!) fIXME(f!) | DONE(d!) CANCELLED(c@)
#+STARTUP: hideblocks

* DONE src/jsnake/errors.py
  :LOGBOOK:
  CLOCK: [2023-11-05 Sun 17:01]--[2023-11-05 Sun 17:10] =>  0:09
  :END:
  - State "DONE"       from "TODO"       [2023-11-05 Sun 17:10]
  - State "TODO"       from              [2023-11-05 Sun 17:02]

[[file:src/jsnake/errors.py][Link]]

- [-] Audit ~ErrorEnum~ and see if it is really useful
  - [ ] Yes
  - [X] No
- [-] Audit ~Result~ and see if it is really useful
  - [ ] Yes
  - [X] No
- [X] Remove ~EnvError~
- [X] Move ~ConstantError~ to utils.py
- [X] Remove ~InvalidSignal~

* DONE src/jsnake/signals.py
  - State "DONE"       from "TODO"       [2023-11-05 Sun 17:53]
  - State "TODO"       from              [2023-11-05 Sun 17:12]
  :LOGBOOK:
  CLOCK: [2023-11-05 Sun 17:42]--[2023-11-05 Sun 17:53] =>  0:11
  CLOCK: [2023-11-05 Sun 17:12]--[2023-11-05 Sun 17:39] =>  0:27
  :END:

[[file:src/jsnake/signals.py][Link]]

- [X] Remove ~InvalidSignalError~

- [X] Class ~signal~
  - [X] Method ~connect~
    - [X] Error if bind is already defined
  - [X] Method ~_is_signal_bind~
    - [X] Make this check more thorough

* DONE src/jsnake/interface/__init__.py
  - State "DONE"       from "TODO"       [2023-11-05 Sun 18:17]
  - State "TODO"       from              [2023-11-05 Sun 18:05]
  :LOGBOOK:
  CLOCK: [2023-11-05 Sun 18:05]--[2023-11-05 Sun 18:17] =>  0:12
  :END:

[[file:src/jsnake/interface/__init__.py][Link]]

- [-] Is ~_Column~ used in other places?
  - [ ] Yes
  - [ ] No
  - [X] unknown
- [-] Can be ~_StateSpec~ be put in ~TYPE_CHECKING~?
  - [X] Yes
  - [ ] No
- [X] Move all type aliases into a separate module
* DONE src/jsnake/interface/dialog.py
  - State "DONE"       from "TODO"       [2023-12-02 Sat 05:38]
  - State "TODO"       from "DONE"       [2023-12-02 Sat 03:54]
  - State "DONE"       from "TODO"       [2023-12-02 Sat 03:51]
  - State "TODO"       from "DONE"       [2023-12-02 Sat 02:42]
  - State "DONE"       from "TODO"       [2023-11-29 Wed 13:47]
  - State "TODO"       from "TODO"       [2023-11-29 Wed 12:56]
  :LOGBOOK:
  CLOCK: [2023-12-02 Sat 05:25]--[2023-12-02 Sat 05:38] =>  0:13
  CLOCK: [2023-12-02 Sat 04:29]--[2023-12-02 Sat 05:00] =>  0:31
  CLOCK: [2023-12-02 Sat 03:54]--[2023-12-02 Sat 04:19] =>  0:25
  CLOCK: [2023-12-02 Sat 03:35]--[2023-12-02 Sat 03:51] =>  0:16
  CLOCK: [2023-12-02 Sat 03:18]--[2023-12-02 Sat 03:20] =>  0:02
  CLOCK: [2023-12-02 Sat 02:44]--[2023-12-02 Sat 02:45] =>  0:01
  CLOCK: [2023-11-29 Wed 13:41]--[2023-11-29 Wed 13:49] =>  0:08
  :END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-12-02 Sat 05:38]
| Headline                       | Time   |      |
|--------------------------------+--------+------|
| *Total time*                   | *2:06* |      |
|--------------------------------+--------+------|
| src/jsnake/interface/dialog.py | 2:06   |      |
| \_  Init                       |        | 0:30 |
#+END:

** DONE Init
   - State "DONE"       from "TODO"       [2023-11-29 Wed 13:35]
   - State "TODO"       from "DONE"       [2023-11-29 Wed 13:31]
   - State "DONE"       from "TODO"       [2023-11-29 Wed 13:30]
   - State "TODO"       from "TODO"       [2023-11-29 Wed 13:02]
   :LOGBOOK:
   CLOCK: [2023-11-29 Wed 13:32]--[2023-11-29 Wed 13:35] =>  0:03
   CLOCK: [2023-11-29 Wed 13:03]--[2023-11-29 Wed 13:30] =>  0:27
   :END:

** DONE ok
   - State "DONE"       from "TODO"       [2023-11-29 Wed 13:40]
   - State "TODO"       from "DONE"       [2023-11-29 Wed 13:35]

** DONE cancel
   - State "DONE"       from "TODO"       [2023-11-29 Wed 13:40]
   - State "TODO"       from              [2023-11-29 Wed 13:36]

** DONE validate
   - State "DONE"       from "TODO"       [2023-11-29 Wed 13:44]
   - State "TODO"       from              [2023-11-29 Wed 13:36]

** DONE apply
   - State "DONE"       from "TODO"       [2023-11-29 Wed 13:47]
   - State "TODO"       from              [2023-11-29 Wed 13:36]

** DONE Message Box
   - State "DONE"       from "TODO"       [2023-12-02 Sat 05:38]
   - State "TODO"       from "DONE"       [2023-12-02 Sat 03:53]
   - State "DONE"       from "TODO"       [2023-12-02 Sat 03:51]
   - State "TODO"       from              [2023-12-02 Sat 02:43]

   - [X] types (display only) [6/6]
     - [X] abortretryignore
     - [X] ok
     - [X] okcancel
     - [X] retrycancel
     - [X] yesno
     - [X] yesnocancel
   - [X] functionality [6/6]
     - [X] abortretryignore [2/2]
       - [X] blocking
       - [X] nonblocking
     - [X] ok [2/2]
       - [X] blocking
       - [X] nonblocking
     - [X] okcancel [2/2]
       - [X] blocking
       - [X] nonblocking
     - [X] retrycancel [2/2]
       - [X] blocking
       - [X] nonblocking
     - [X] yesno [2/2]
       - [X] blocking
       - [X] nonblocking
     - [X] yesnocancel [2/2]
       - [X] blocking
       - [X] nonblocking

*** TODO Default
    - State "TODO"       from "DONE"       [2023-12-02 Sat 05:40]

*** DONE Message
    - State "DONE"       from "TODO"       [2023-12-03 Sun 11:59]
    - State "TODO"       from              [2023-12-02 Sat 05:40]
    :LOGBOOK:
    CLOCK: [2023-12-03 Sun 09:57]--[2023-12-03 Sun 11:59] =>  2:02
    :END:

*** DONE Details
    - State "DONE"       from "TODO"       [2023-12-03 Sun 11:59]
    - State "TODO"       from              [2023-12-02 Sat 05:40]
